src/Documents/ЭлектронноеПисьмоИсходящее.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмоИсходящее</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщенияОтправкаIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторыОснований</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПредставление</Name>
					<Comment>Текстовое описание отправителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработатьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПолучателейСкрытыхКопий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПисьма</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИсходящегоЭлектронногоПисьма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиПисьма</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкрытыхКопий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НепринятыеВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяВложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПисьмаВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Письмо</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомерВоВложениях</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/КонтактыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтактыМессенджеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбъектИдентификации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдПоследнегоДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерМессенджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеУчаствоватьВРассылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПушУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мессенджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЭлектронноеПисьмоИсходящее/Forms/ФормаОтправкиСообщения/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере.
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагент") Тогда
		ЭтотОбъект.Контрагент = Параметры.Контрагент;
	КонецЕсли;
	
	Если Параметры.Свойство("Заявка") Тогда
		ЭтотОбъект.Заявка = Параметры.Заявка;
	КонецЕсли;  
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		ЭтотОбъект.ДокументОснование = Параметры.ДокументОснование;
	КонецЕсли;	
	
	Если Параметры.Свойство("ДоступныеНомераТелефонов") Тогда
		ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов = Параметры.ДоступныеНомераТелефонов;
	КонецЕсли;
	
	Если Параметры.Свойство("СписокНомеровТелефоновPush") Тогда
		ЭтотОбъект.ВзаимодействиеPushСписокНомеровТелефонов = Параметры.СписокНомеровТелефоновPush;
	КонецЕсли;
	
	Если Параметры.Свойство("ДоступныеАдресаЭП") Тогда
		ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП = Параметры.ДоступныеАдресаЭП;
		Если ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП.Количество() > 0 Тогда
			ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП = ВзаимодействиеПисьмоСписокАдресовЭП[0].Значение; 
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("ВзаимодействиеSMSНомерТелефона") Тогда 
		ЭтотОбъект.ВзаимодействиеSMSНомерТелефона = Параметры.ВзаимодействиеSMSНомерТелефона;
	КонецЕсли;
	
	Если Параметры.Свойство("ВзаимодействиеPushНомерТелефона") Тогда
		ЭтотОбъект.ВзаимодействиеPushНомерТелефона = Параметры.ВзаимодействиеPushНомерТелефона;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекстСообщенияSms") Тогда
		ЭтотОбъект.ВзаимодействиеSMSТекст = Параметры.ТекстСообщенияSms;	
	КонецЕсли;
	
	Если Параметры.Свойство("ВзаимодействиеСделка") Тогда
		ЭтотОбъект.ВзаимодействиеСделка = Параметры.ВзаимодействиеСделка;
		УстановитьАктуальнуюСделкуВзаимодействия();
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокФормы") Тогда
		ЭтаФорма.Заголовок = Параметры.ЗаголовокФормы;
	КонецЕсли;
	
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ЭтотОбъект.ТекущийПользователь 		 = ПараметрыСеанса.ТекущийПользователь;
	
	ЭтотОбъект.ВзаимодействиеPushВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	
	Если Параметры.Свойство("МессенджерВключен") И Параметры.МессенджерВключен Тогда
		ЭтотОбъект.МессенджерДоступен = Истина;
		ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер");
		ЗаполнитьСписокТелефоновДляWhatsApp();
		УстановитьВидимостьОтправкиВМессенджер();
	Иначе
		Если Параметры.Свойство("ДоступныеНомераТелефонов") И Параметры.ДоступныеНомераТелефонов.Количество() > 0 Тогда
			ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS"); 
			Элементы.ГруппаКнопкиSms.ЦветФона    = Новый Цвет(25,  116, 206);		
			Элементы.ПереключательSms.ЦветТекста = Новый Цвет(255, 255, 255);
			Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = Истина;
		Иначе
			ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо"); 
			Элементы.ГруппаКнопкиПисьмо.ЦветФона    = Новый Цвет(25,  116, 206);		
			Элементы.ПереключательПисьмо.ЦветТекста = Новый Цвет(255, 255, 255);
		КонецЕсли;                                                           
		ЭтотОбъект.МессенджерДоступен = Ложь;
		Элементы.ГруппаПерейтиВЧат.Видимость = Ложь;
		Элементы.ГруппаКнопкиМессенджер.Видимость = Ложь;
		Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = Ложь;
	КонецЕсли;
	
	ЗагрузитьСписокШаблоновСМСМессенджер();
	
	УстановитьВидимостьИДоступностьФормы(); 
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	СоздатьSMSРассылкуНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSВыбратьТелефон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьТелефонЗавершение", ЭтотОбъект);
	
	Если ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") 
		ИЛИ ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		
		СписокЗначений = ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов;
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда
		СписокЗначений = ЭтотОбъект.ВзаимодействиеПисьмоСписокАдресовЭП;
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление")	Тогда
		СписокЗначений = ЭтотОбъект.ВзаимодействиеPushСписокНомеровТелефонов;
	КонецЕсли;
	
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSВыбрать телефон завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьТелефонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ВзаимодействиеКаналРассылки = Результат.Значение;
		
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = Результат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблон(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSВыбратьШаблонЗавершение", ЭтотОбъект);
	
	Если ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS")
		Или ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда		
		
		СписокЗначений = ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов;
		
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
	    СписокЗначений = ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов; 
		
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда		
		СписокЗначений = ЭтотОбъект.ВзаимодействиеПисьмоСписокШаблонов;		
		
	КонецЕсли;
	
	ПоказатьВыборИзМеню(Оповещение, СписокЗначений);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS выбрать шаблон текста завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПараметры - 	 -
//
Процедура ВзаимодействиеSMSВыбратьШаблонЗавершение(Результат, ДопПараметры) Экспорт
	
	ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
	
	Если Результат <> Неопределено  Тогда
		
		ЭтотОбъект.ШаблонСообщения = Результат.Значение;
		ЭтотОбъект.ВзаимодействиеSMSТекст = ПолучитьСодержаниеШаблона(Результат.Значение, ЭтотОбъект.ТипСообщенияPushSMS);
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает содержание переданного шаблона.
//
Функция ПолучитьСодержаниеШаблона(ШаблонСообщения, ТипСообщения)
	
	//Если ТипСообщения = Перечисления.ТипыСобытий.ПушУведомление Тогда
	//	ИмяПоля = "СодержаниеPush";
	//	
	//Иначе
	Если ТипСообщения = Перечисления.ТипыСобытий.Мессенджер Тогда
		ИмяПоля = "СодержаниеМессенджер";
		
	Иначе
		ИмяПоля = "Содержание";
		
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ШаблоныСообщений." + ИмяПоля + " КАК Содержание
	|ИЗ
	|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
	|ГДЕ
	|	ШаблоныСообщений.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", ШаблонСообщения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Содержание, "");
	
КонецФункции

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервис(Команда)
	
	Если НаличиеСервисовSMSРассылки() Тогда
		Оповещение = Новый ОписаниеОповещения("ВзаимодействиеSMSНастроитьСервисЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаВыбора",, ЭтаФорма,,,, Оповещение);
	Иначе
		ОткрытьФорму("Справочник.СервисыРассылки.ФормаОбъекта",, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSНастроить сервис завершение.
//
// Параметры:
//  Результат	 - 	 -
//  ДопПаарметры - 	 -
//
Процедура ВзаимодействиеSMSНастроитьСервисЗавершение(Результат, ДопПараметры = Неопределено) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ЗаполнитьСервисSMSРассылкиПоУмолчанию(Результат);
		Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость = Ложь;
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость        = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMSТекст при изменении.
//
Процедура ВзаимодействиеSMSТекстПриИзменении(Элемент)
	
	Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") 
		Или ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить.
//
// Параметры:
//  Команда	 - 	 -
//
Процедура ВзаимодействиеSMSОтправить(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеSMSТекст) Тогда
		
		Если (ЭтотОбъект.ТипСообщенияPushSMS <> ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") 
			И ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеКаналРассылки)) 
			Или (ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер")
			Или ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление"))Тогда
			
			ВзаимодействиеSMSPushОтправитьСервер();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены параметры сообщения!");	
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнены данные сообщения!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПереключательSms".
//
Процедура ПереключательSms(Команда)
	
	УстановитьНеАктивностьПереключателямSmsPushMessage();
	
	Элементы.ГруппаКнопкиSms.ЦветФона    = Новый Цвет(25,  116, 206);		
	Элементы.ПереключательSms.ЦветТекста = Новый Цвет(255, 255, 255);
	
	ЭтаФорма.ТекущийЭлемент        = Элементы.ВзаимодействиеSMSТекст;
	ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS");
	
	ВзаимодействиеSMSТекст = "";
	ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	СоздатьSMSРассылкуНаКлиенте();
	ЗагрузитьСписокШаблоновСМСМессенджер();
	
КонецПроцедуры

&НаСервере
// Процедура - Загрузить список шаблонов СМСМессенджер
//
Процедура ЗагрузитьСписокШаблоновСМСМессенджер()

	Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") 
		Или ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
		
		ДоступныеШаблоны = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.SMS);
		ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Очистить();
		Для Каждого Шаблон Из ДоступныеШаблоны Цикл 
			ЭтотОбъект.ВзаимодействиеSMSСписокШаблонов.Добавить(Шаблон.Ссылка, Шаблон.Наименование);	
		КонецЦикла;
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		
		ДоступныеШаблоны = Справочники.ШаблоныСообщений.ПолучитьШаблоныСообщений(Перечисления.ТипыСобытий.Мессенджер);  
		ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов.Очистить();
		Для Каждого Шаблон Из ДоступныеШаблоны Цикл 
			ЭтотОбъект.ВзаимодействиеМессенджерСписокШаблонов.Добавить(Шаблон.Ссылка, Шаблон.Наименование);	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ПереключательPush".
//
Процедура ПереключательPush(Команда)
	
	УстановитьНеАктивностьПереключателямSmsPushMessage();
	
	Элементы.ГруппаКнопкиPush.ЦветФона    = Новый Цвет(25,  116, 206);	
	Элементы.ПереключательPush.ЦветТекста = Новый Цвет(255, 255, 255);
	
	ЭтаФорма.ТекущийЭлемент        = Элементы.ВзаимодействиеSMSТекст;
	ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление");
	ВзаимодействиеSMSТекст = "";
	
	СоздатьSMSРассылкуНаКлиенте();
	ЗагрузитьСписокШаблоновСМСМессенджер();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПереключательПисьмо"
//
Процедура ПереключательПисьмо(Команда)
	
	УстановитьНеАктивностьПереключателямSmsPushMessage();
	
	Элементы.ГруппаКнопкиПисьмо.ЦветФона    = Новый Цвет(25,  116, 206);	
	Элементы.ПереключательПисьмо.ЦветТекста = Новый Цвет(255, 255, 255);
	
	ЭтаФорма.ТекущийЭлемент        = Элементы.ВзаимодействиеSMSТекст;
	ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо");
	ВзаимодействиеSMSТекст = "";
	
	СоздатьSMSРассылкуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПереключательМессенджер"
//
Процедура ПереключательМессенджер(Команда)
	
	УстановитьНеАктивностьПереключателямSmsPushMessage();
	
	Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = Ложь;
	Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = Истина;
	
	Элементы.ГруппаКнопкиМессенджер.ЦветФона    = Новый Цвет(25,  116, 206);	
	Элементы.ПереключательМессенджер.ЦветТекста = Новый Цвет(255, 255, 255);
	
	ЭтаФорма.ТекущийЭлемент        = Элементы.ВзаимодействиеSMSТекст;
	ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер");
	
	ВзаимодействиеSMSТекст = "";
	ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов();
	
	СоздатьSMSРассылкуНаКлиенте();
	ЗагрузитьСписокШаблоновСМСМессенджер();

КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события команды "ВзаимодействиеПисьмоНастроитьСервис".
//
Процедура ВзаимодействиеПисьмоНастроитьСервис(Команда)
	
	ОткрытьФорму("Справочник.УчетныеЗаписиЭлектроннойПочты.ФормаОбъекта", Новый Структура("ПользовательУчетнойЗаписи", ЭтотОбъект.ТекущийПользователь), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор сделки взаимодействия.
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ВыборСделкиВзаимодействия(Команда)
	
	СписокВыбора = ВернутьСписокСделокКлиента(Контрагент);
	
	Если ЗначениеЗаполнено(СписокВыбора) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОбработчикВыбораСделкиВзаимодействия", ЭтотОбъект);
		ПоказатьВыборИзМеню(Оповещение, СписокВыбора, Элементы.ВзаимодействиеСделка);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Нет доступных сделок!';en='Not available deals!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды.
//
Процедура ПерейтиВЧат(Команда)
	
	//Если Не ЗначениеЗаполнено(ЭтотОбъект.ВнешняяСистемаМессенджера) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выберите внешнюю систему мессенджера'; en = 'Choose messenger external system'"));
	//	Возврат;
	//КонецЕсли;
	
	ДанныеКанала = ТаблицаКаналовРассылки.НайтиПоИдентификатору(ЭтотОбъект.ИдентификаторКаналаМессенджер);
	
	Если ДанныеКанала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиВЧатЗавершение(ДанныеКанала);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения перехода в чат мессенджера.
//
Процедура ПерейтиВЧатЗавершение(ДанныеКанала)
	
	ОписаниеОшибки = "";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбъектСсылка = Контрагент;
	Иначе
		ОбъектСсылка = Заявка; 
	КонецЕсли;
	
	ИдСообщения = УстановитьОжиданиеСообщения(ДанныеКанала.ИдКлиента, ДанныеКанала.ВнешняяСистема, ОписаниеОшибки, ОбъектСсылка, ДанныеКанала.НомерМессенджера);
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ДанныеКаналаСтруктура = Новый Структура;
	ДанныеКаналаСтруктура.Вставить("ИдКлиента"		, ДанныеКанала.ИдКлиента);
	ДанныеКаналаСтруктура.Вставить("ВнешняяСистема"	, ДанныеКанала.ВнешняяСистема);
	ДанныеКаналаСтруктура.Вставить("ИдСообщения"	, ИдСообщения);
	
	ПараметрыОткрытия = Новый Структура("ДанныеКанала", ДанныеКаналаСтруктура);
	
	Оповестить("ОткрытьДиалог", ПараметрыОткрытия);
	ОткрытьФорму("Обработка.Мессенджер_Стоматология.Форма", ПараметрыОткрытия,,,,,, РежимОткрытияОкнаФормы.Независимый);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, создает канал мессенджера.
//
Функция СоздатьКонтактМессенджера(ВнешняяСистема, Контрагент, Знач НомерТелефона)
	
	НомерТелефона = ОбщегоНазначенияКлиентСерверСтоматология.ВернутьПриведенныйНомер(НомерТелефона, Ложь);
	НомерТелефона = ?(СтрДлина(НомерТелефона) > 10 И Лев(НомерТелефона, 1) = "8", "7" + Сред(НомерТелефона, 2), НомерТелефона);
	
	ИдКлиента = НомерТелефона + "@c.us";
	ИдСообщения	 = Строка(Новый УникальныйИдентификатор);
	
	ДанныеКонтакта = Новый Структура;
	ДанныеКонтакта.Вставить("ИдКлиента"		, ИдКлиента);
	ДанныеКонтакта.Вставить("ИдСообщения"	, ИдСообщения);
	
	КонтактСуществует = РегистрыСведений.КонтактыМессенджеров.КонтактМессенджераСуществует(ИдКлиента, ВнешняяСистема);
	
	Если КонтактСуществует = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Контакт с таким номером уже привязан к другому клиенту'; en = 'Contact with this number already linked to another client'")
		);
		Возврат ДанныеКонтакта;
	КонецЕсли;
	
	НовыйДиалог					 = РегистрыСведений.Диалоги.СоздатьМенеджерЗаписи();
	НовыйДиалог.ИдДиалога		 = Строка(Новый УникальныйИдентификатор);
	НовыйДиалог.ВнешняяСистема	 = ВнешняяСистема;
	НовыйДиалог.ИдКлиента		 = ИдКлиента;
	НовыйДиалог.Начало			 = Дата(2022, 1, 1);
	НовыйДиалог.Окончание		 = Дата(2022, 1, 1);
	
	НовыйДиалог.Записать();
	
	РегистрыСведений.КонтактыМессенджеров.ЗаписатьИдентификаторМессенджера(
		ИдКлиента,
		Контрагент,
		НомерТелефона,,
		ВнешняяСистема,
		ОбщегоНазначения.ПолучитьЗначениеРеквизита(Контрагент, "Наименование"),,,,
		НовыйДиалог.ИдДиалога
	);
	
	РегистрыСведений.ЖурналСообщений.ДобавитьЗапистьЖурналСообщений(
		ИдКлиента,
		ИдСообщения,,,
		НСтр("ru = 'Создан контакт'"),
		Истина,
		Перечисления.Мессенджеры.whatsapp,
		Ложь,
		ТекущаяДатаСеанса(),
		ВнешняяСистема,,,,,,,,,
		НовыйДиалог.ИдДиалога,
		Истина
	);
	
	Возврат ДанныеКонтакта;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, создает сообщение с признаком ожидания сообщения.
//
Функция УстановитьОжиданиеСообщения(ИдКлиента, ВнешняяСистема, ОписаниеОшибки, Объект = Неопределено, НомерТелефона = "")
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		
		ДанныеКонтакта	 = СоздатьКонтактМессенджера(ВнешняяСистема, Объект, НомерТелефона);
		ИдКлиента		 = ДанныеКонтакта.ИдКлиента;
		ИдСообщения		 = ДанныеКонтакта.ИдСообщения;
		
	Иначе
		ИдСообщения = МессенджерСтоматология.ПолучитьИдОжидающегоСообщенияВМесенджер(ИдКлиента, ВнешняяСистема);
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИдКлиента) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось создать клиента в мессенджере.'; en = 'Failed to create messenger client.'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИдСообщения;
	
КонецФункции

&НаСервере
// Процедура - устанавливает доступность элементов формы.
//
Процедура УстановитьВидимостьИДоступностьФормы()
	
	Если Не ЗначениеЗаполнено(ВзаимодействиеSMSСписокНомеровТелефонов) Тогда
		
		Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
			
			УстановитьНеАктивностьПереключателямSmsPushMessageНаСервере();
			
			Элементы.ГруппаКнопкиPush.ЦветФона    = Новый Цвет(25,  116, 206);	
			Элементы.ПереключательPush.ЦветТекста = Новый Цвет(255, 255, 255);
			
			ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление");
			
		КонецЕсли;
		
		Элементы.ПереключательSms.Доступность = Ложь;
		
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеPushВнешняяСистемаWallet) И Справочники.Карты.КлиентУчаствуетВРассылкеWallet(ЭтотОбъект.Контрагент)) Тогда
		
		Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
			
			УстановитьНеАктивностьПереключателямSmsPushMessageНаСервере();
			
			Элементы.ГруппаКнопкиПисьмо.ЦветФона    = Новый Цвет(25,  116, 206);	
			Элементы.ПереключательПисьмо.ЦветТекста = Новый Цвет(255, 255, 255);
			
			ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо");
			
		КонецЕсли;
		
		Элементы.ПереключательPush.Доступность = Ложь;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВзаимодействиеПисьмоАдресЭП) Тогда
		
		Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда
			
			УстановитьНеАктивностьПереключателямSmsPushMessageНаСервере();
			
			Элементы.ГруппаКнопкиМессенджер.ЦветФона    = Новый Цвет(25,  116, 206);	
			Элементы.ПереключательМессенджер.ЦветТекста = Новый Цвет(255, 255, 255);
			
			ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер");
			
			Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = Ложь;
			Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = Истина;
			
		КонецЕсли;
		
		Элементы.ПереключательПисьмо.Доступность = Ложь;
		
	КонецЕсли;
	
	Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда
		Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Не НаличиеПочтовогоАккаунта();
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
		Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость     = Не НаличиеСервисаSMSРассылки();
	КонецЕсли;
	
	Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость = Не Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость ИЛИ Не Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость;
	
КонецПроцедуры

&НаКлиенте
// Процедура, создает sms рассылку.
//
Процедура СоздатьSMSРассылкуНаКлиенте()
	
	Элементы.ВзаимодействиеПисьмоТема.Видимость = ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо");
	Элементы.ГруппаВаимодействиеСделкаПредставление.Видимость		 = Ложь;
	Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость		 = Ложь;
	Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость	 = Ложь;
	Элементы.ВзаимодействиеSMSВыбратьШаблон.Видимость				 = Не (ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо"));
	
	Если ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
		
		НайденныеСтрокиКИ = ВзаимодействиеSMSСписокНомеровТелефонов; 
		
		Если ЗначениеЗаполнено(НайденныеСтрокиКИ) и ЗначениеЗаполнено(НайденныеСтрокиКИ[0].Значение) Тогда
			
			МассивНомеровТелефонов = Новый Массив;
			
			Для Каждого СтрокаКИ Из НайденныеСтрокиКИ Цикл
				МассивНомеровТелефонов.Добавить(СтрокаКИ.Значение);
			КонецЦикла;
			
			Если ЗначениеЗаполнено(МассивНомеровТелефонов) Тогда
				
				ЭтотОбъект.ВзаимодействиеSMSСписокНомеровТелефонов.ЗагрузитьЗначения(МассивНомеровТелефонов);
				
				Если Не (ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеКаналРассылки)
					И МассивНомеровТелефонов.Найти(ЭтотОбъект.ВзаимодействиеКаналРассылки) <> Неопределено) Тогда
					
					ЭтотОбъект.ВзаимодействиеКаналРассылки = МассивНомеровТелефонов[0];
				КонецЕсли;
				
				Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок  = ЭтотОбъект.ВзаимодействиеКаналРассылки;
				Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость = Не НаличиеСервисаSMSРассылки(); 
				Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость        = Не Элементы.ГруппаВзаимодействиеSMSНастроитьСервис.Видимость;
				Элементы.ГруппаВаимодействиеСделкаПредставление.Видимость = ЗначениеЗаполнено(Контрагент); //ОбщегоНазначения.ЭтоВерсияКОРП() И 
				
				ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента запрещена рассылка sms сообщений");
			КонецЕсли;
			
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не задан номер телефона");
			
			ЭтотОбъект.ВзаимодействиеКаналРассылки = "";
			Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = "Выбрать канал рассылки";
			
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
		
		Элементы.ВзаимодействиеSMSСтатусВведенныхСимволов.Видимость	 = Ложь;
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость	 = Ложь;
		Элементы.ГруппаПерейтиВЧат.Видимость						 = Ложь;
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость			 = Истина;
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда 	
		
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость = Истина;
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
		
	ИначеЕсли ЭтотОбъект.ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда 
		
		НайденныеСтрокиКИ = ВзаимодействиеПисьмоСписокАдресовЭП;
		
		Если НЕ ЗначениеЗаполнено(НайденныеСтрокиКИ) ИЛИ НЕ ЗначениеЗаполнено(НайденныеСтрокиКИ[0].Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У клиента не указан адрес электронной почты");
		КонецЕсли;
		
		Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость = Не НаличиеПочтовогоАккаунта();
		Элементы.ГруппаВзаимодействиеSMSОсновная.Видимость         	  = Не Элементы.ГруппаВзаимодействиеПисьмоНастроитьАккаунт.Видимость;
		Элементы.ГруппаВаимодействиеСделкаПредставление.Видимость     = ЗначениеЗаполнено(Контрагент); //ОбщегоНазначения.ЭтоВерсияКОРП() И 
		
		ЭтотОбъект.ВзаимодействиеКаналРассылки = НайденныеСтрокиКИ[0].Значение;
		Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Заголовок = ЭтотОбъект.ВзаимодействиеКаналРассылки;
		
		ЭтаФорма.ТекущийЭлемент = Элементы.ВзаимодействиеSMSТекст;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисовSMSРассылки()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СервисыРассылки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СервисыРассылки КАК СервисыРассылки
	|ГДЕ
	|	СервисыРассылки.ПометкаУдаления = ЛОЖЬ");
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Проверить наличие почтового аккаунта.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеПочтовогоАккаунта()
	
	Возврат ЗначениеЗаполнено(УправлениеЭлектроннойПочтой.ПолучитьУчетнуюЗаписьДляОтправкиПоУмолчанию());
	
КонецФункции

&НаСервереБезКонтекста
// Процедура - Заполнить сервис SMSРассылки по умолчанию.
//
// Параметры:
//  СервисSMSРассылки	 - 	 -
//
Процедура ЗаполнитьСервисSMSРассылкиПоУмолчанию(СервисSMSРассылки)
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.СервисSMSРассылкиПоУмолчанию.Установить(СервисSMSРассылки);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обновляет колличество введенных символов.
//
Процедура ВзаимодействиеSMSОбновитьСтатусВведеныхСимволов()
	
	// Удаляем символы переноса строки.
	мТекст = НРег(ЭтотОбъект.ВзаимодействиеSMSТекст);
	
	// 1-sms это 160 символов, если больше 160 символов, тогда 1 sms = 153.
	РазмерностьСообщения = ?(СтрДлина(мТекст) > 160, 153, 160);
	КоличествоСМС = 0;
	
	СтрокаСимволов = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя@_$^~`№";
	
	Для а = 1 По СтрДлина(СтрокаСимволов) Цикл
		
		Если Найти(мТекст, Сред(СтрокаСимволов, а, 1)) > 0 Тогда
			
			// 1-sms это 70 символов, если больше 70 символов, тогда 1 sms = 67.
			РазмерностьСообщения = ?(СтрДлина(мТекст) > 70, 67, 70);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоСимволов = СтрДлина(мТекст);
	КоличествоСМС      = Цел(СтрДлина(мТекст) / РазмерностьСообщения) + ?(СтрДлина(мТекст) % РазмерностьСообщения > 0, 1, 0);
	
	ПредставлениеСимволов = СтрокаСЧислом(";%1 символ;;%1 символа; %1 символов;%1 символа", КоличествоСимволов, ВидЧисловогоЗначения.Количественное, "L=ru"); 
	Если ЭтотОбъект.ТипСообщенияPushSMS <> ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда
		ЭтотОбъект.ВзаимодействиеSMSСтатусВведенныхСимволов = ПредставлениеСимволов + ", " + КоличествоСМС + " sms";
	Иначе
		ЭтотОбъект.ВзаимодействиеSMSСтатусВведенныхСимволов = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Взаимодействие SMS Отправить сервер.
//
Процедура ВзаимодействиеSMSPushОтправитьСервер()
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ПолучательСсылка = Контрагент;
	ИначеЕсли ЗначениеЗаполнено(Заявка) Тогда 
		ПолучательСсылка = Заявка;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	
	ОписаниеОшибки = "";
	
	Если ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.SMS") Тогда
		
		ДокументСоздан = СоздатьДокументРассылкаСообщенийИОтправитьSMSНаСервере(
			ПолучательСсылка, 
			ЭтотОбъект.ВзаимодействиеSMSНомерТелефона, 
			ЭтотОбъект.ВзаимодействиеSMSТекст,
			ЭтотОбъект.ВзаимодействиеСделка,
			ЭтотОбъект.ТекущаяСтруктурнаяЕдиница,
			ОписаниеОшибки
		); 
		
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.ПушУведомление") Тогда
		
		ДокументСоздан = СоздатьДокументРассылкаСообщенийИОтправитьPushНаСервере(
			ПолучательСсылка, 
			ЭтотОбъект.ВзаимодействиеPushВнешняяСистемаWallet, 
			ЭтотОбъект.ВзаимодействиеSMSТекст,
			ЭтотОбъект.ВзаимодействиеСделка,
			ЭтотОбъект.ТекущаяСтруктурнаяЕдиница,
			ОписаниеОшибки
		); 
		
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Письмо") Тогда
		
		ДокументСоздан = СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(
			ПолучательСсылка, 
			ЭтотОбъект.ВзаимодействиеПисьмоАдресЭП,
			ЭтотОбъект.ВзаимодействиеПисьмоТема,
			ЭтотОбъект.ВзаимодействиеSMSТекст,
			ЭтотОбъект.ВзаимодействиеСделка,
			ОписаниеОшибки
		);
		
	ИначеЕсли ТипСообщенияPushSMS = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Мессенджер") Тогда 
		
		ВыбранныйКанал = ЭтотОбъект.ТаблицаКаналовРассылки.НайтиПоИдентификатору(ЭтотОбъект.ИдентификаторКаналаМессенджер);
		
		Если ВыбранныйКанал = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДанныеКанала = Новый Структура;
		ДанныеКанала.Вставить("ИдКлиента"		, ВыбранныйКанал.ИдКлиента);
		ДанныеКанала.Вставить("ВнешняяСистема"	, ВыбранныйКанал.ВнешняяСистема);
		ДанныеКанала.Вставить("НомерМессенджера", ВыбранныйКанал.НомерМессенджера);
		
		ДокументСоздан = СоздатьДокументРассылкаСообщенийИОтправитьСообщениеМессенджерНаСервере(
			ПолучательСсылка, 
			ДанныеКанала,
			ЭтотОбъект.ВзаимодействиеSMSТекст,
			ЭтотОбъект.ТекущаяСтруктурнаяЕдиница,
			ЭтотОбъект.ШаблонСообщения,
			ЭтотОбъект.ДокументОснование,
			ОписаниеОшибки
		);
		
	КонецЕсли;
	
	Если ДокументСоздан = Ложь Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сообщение не доставлено: " + ОписаниеОшибки);
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ВзаимодействиеSMSТекст      = "";
	ЭтотОбъект.ВзаимодействиеКаналРассылки = "";
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Проверить наличие сервиса SMSРассылки.
//
// Возвращаемое значение:
//   -
//
Функция НаличиеСервисаSMSРассылки()
	
	Возврат Не Константы.СервисSMSРассылкиПоУмолчанию.Получить().Пустая();
	
КонецФункции

&НаКлиенте
// Процедура, устанавливает не активность переключателям SmsPushMessage.
//
Процедура УстановитьНеАктивностьПереключателямSmsPushMessage()
	
	Элементы.ГруппаКнопкиSms.ЦветФона        = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиPush.ЦветФона       = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиМессенджер.ЦветФона = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиПисьмо.ЦветФона 	 = Новый Цвет(242, 242, 242);
	
	Элементы.ПереключательSms.ЦветТекста        = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательPush.ЦветТекста       = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательМессенджер.ЦветТекста = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательПисьмо.ЦветТекста 	= Новый Цвет(0 ,0 ,0);
	
	Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = Истина;
	Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = Ложь;
	
КонецПроцедуры	

&НаСервере
// Процедура, устанавливает не активность переключателям SmsPushMessage.
//
Процедура УстановитьНеАктивностьПереключателямSmsPushMessageНаСервере()
	
	Элементы.ГруппаКнопкиSms.ЦветФона        = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиPush.ЦветФона       = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиМессенджер.ЦветФона = Новый Цвет(242, 242, 242);	
	Элементы.ГруппаКнопкиПисьмо.ЦветФона 	 = Новый Цвет(242, 242, 242);
	
	Элементы.ПереключательSms.ЦветТекста        = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательPush.ЦветТекста       = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательМессенджер.ЦветТекста = Новый Цвет(0 ,0 ,0);
	Элементы.ПереключательПисьмо.ЦветТекста 	= Новый Цвет(0 ,0 ,0);
	
	Элементы.ВзаимодействиеSMSВыбратьНомерТелефона.Видимость = Истина;
	Элементы.ГруппаВыбораВнешнейСистемыМессенджера.Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
// Процедура, устананвливает видимость доступных каналов рассылки в мессенджер.
//
Процедура УстановитьВидимостьОтправкиВМессенджер()
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбъектСсылка = Контрагент;
	ИначеЕсли ЗначениеЗаполнено(Заявка) Тогда 
		ОбъектСсылка = Заявка;
	КонецЕсли;
	
	Элементы.ИдентификаторКаналаМессенджер.СписокВыбора.Очистить();
	
	ДанныеКаналовОтправки = Документы.РассылкаСообщений.ПолучитьДоступныеДляОтправкиВнешниеСистемыМессенджера(ОбъектСсылка, ЭтотОбъект.ТекущаяСтруктурнаяЕдиница);
	
	Если Не ЗначениеЗаполнено(ДанныеКаналовОтправки) Тогда
		Элементы.ПереключательМессенджер.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ВнешняяСистемаМессенджера = ДанныеКаналовОтправки[0].ВнешняяСистема;
	
	Для Каждого ДанныеКанала Из ДанныеКаналовОтправки Цикл
		
		КаналРассылки = ЭтотОбъект.ТаблицаКаналовРассылки.Добавить();
		
		ЗаполнитьЗначенияСвойств(КаналРассылки, ДанныеКанала);
		
		Элементы.ИдентификаторКаналаМессенджер.СписокВыбора.Добавить(
			КаналРассылки.ПолучитьИдентификатор(),
			ПолучитьПредставлениеКаналаОтправки(ДанныеКанала),,
			ПолучитьКартинкуМессенджера(ДанныеКанала.ТипВнешнейСистемы)
		);
		
	КонецЦикла;
	
	Элементы.ПереключательМессенджер.Доступность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает представления внешней системы для списка выбора.
//
Функция ПолучитьПредставлениеКаналаОтправки(ДанныеКанала)
	
	Если ДанныеКанала.ИдКлиента = "" Тогда
		Представление = НСтр("ru = 'Создать контакт'") + " (" + ДанныеКанала.НомерМессенджера + ")" + " - " + ДанныеКанала.НаименованиеВнешнейСистемы;
	Иначе
		Представление = ДанныеКанала.НаименованиеВнешнейСистемы + ?(ЗначениеЗаполнено(ДанныеКанала.НомерМессенджера), " (" + ДанныеКанала.НомерМессенджера + ")", "");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает картинку мессенджера.
//
Функция ПолучитьКартинкуМессенджера(ТипВнешнейСистемы)
	
	Возврат Справочники.ВнешниеСистемы.КартинкаТипаВнешнейСистемы(ТипВнешнейСистемы);
	
КонецФункции	

&НаСервере
// Процедура - Обработчик выбора сделки взаимодействия сервер.
//
// Параметры:
//  Сделка		 - 	 - 
//  ЦветЭтапа	 - 	 - 
//
Процедура УстановитьСостояниеЭлементовСделкиВзаимодействия(Сделка, ЦветЭтапа)
	
	ЦветФона = ?(ЗначениеЗаполнено(ЦветЭтапа), ЗначениеИзСтрокиВнутр(ЦветЭтапа), Новый Цвет());
	ЦветФона = ?(ЦветФона = Новый Цвет(), Новый Цвет(214, 234, 255), ЦветФона);
	
	Представление = ?(ЗначениеЗаполнено(Сделка), Строка(Сделка), НСтр("ru='Выбрать сделку';en='Select a deal'"));
	
	ЭтотОбъект.ВзаимодействиеСделка                          = Сделка; 
	Элементы.ВзаимодействиеСделка.Заголовок                  = Представление;
	ЭтаФорма.Команды["ВзаимодействиеСделка"].Подсказка       = Представление;
	Элементы.ГруппаВаимодействиеСделкаПредставление.ЦветФона = ЦветФона;
	Элементы.ВзаимодействиеСделка.ЦветТекста                 = ОбщегоНазначенияСтоматология.ПолучитьЦветТекстаПоЦветуФона(ЦветФона,Истина);
	
КонецПроцедуры

&НаСервере
// Процедура - Установить актуальную сделку взаимодействия.
//
Процедура УстановитьАктуальнуюСделкуВзаимодействия()
	
	// Установить актуальную сделку клиента.
	ЭтотОбъект.ВзаимодействиеСделка = Справочники.Сделки.ПолучитьАктуальнуюСделкуКлиента(Контрагент);
	
	УстановитьСостояниеЭлементовСделкиВзаимодействия(
	ЭтотОбъект.ВзаимодействиеСделка, 
	?(ЗначениеЗаполнено(ЭтотОбъект.ВзаимодействиеСделка), ЭтотОбъект.ВзаимодействиеСделка.ЭтапСделки.ЦветЭтапа, Неопределено));
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Вернуть список сделок контрагента.
// 
Функция ВернутьСписокСделокКлиента(Контрагент)
	
	СписокСделок = Новый СписокЗначений;
	
	ТаблицаСделок = ПолучитьСделкиКлиента(Контрагент, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Для Каждого СтрокаТ Из ТаблицаСделок Цикл
		
		ПараметрыСделки = Новый Структура;
		ПараметрыСделки.Вставить("Сделка"   , СтрокаТ.Ссылка);
		ПараметрыСделки.Вставить("ЦветЭтапа", СтрокаТ.ЦветЭтапа);
		
		СписокСделок.Добавить(ПараметрыСделки, СтрокаТ.Наименование);	
		
	КонецЦикла;	
	
	Возврат СписокСделок; 
	
КонецФункции

&НаСервереБезКонтекста
// Функция, возвращает сделки по контрагенту.
//
Функция ПолучитьСделкиКлиента(Контрагент, СтруктурнаяЕдиница = Неопределено)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сделки.Ссылка КАК Ссылка,
	|	Сделки.Наименование КАК Наименование,
	|	Сделки.ЭтапСделки КАК ЭтапСделки,
	|	Сделки.ЭтапСделки.ЦветЭтапа КАК ЦветЭтапа
	|ИЗ
	|	Справочник.Сделки КАК Сделки
	|ГДЕ
	|	Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Сделки.Контрагент = &Контрагент
	|	И Сделки.ПометкаУдаления = ЛОЖЬ	
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сделки.ДатаСделки");
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда 
		МассивСтруктурныхЕдиниц = Справочники.СтруктурныеЕдиницы.ВернутьМассивСтруктурныхЕдиниц(, Истина);
		Если МассивСтруктурныхЕдиниц.Найти(Справочники.СтруктурныеЕдиницы.ПустаяСсылка()) = Неопределено Тогда 
			МассивСтруктурныхЕдиниц.Добавить(Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
		КонецЕсли;		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Сделки.СтруктурнаяЕдиница = &СтруктурнаяЕдиница", "Сделки.СтруктурнаяЕдиница В(&СтруктурнаяЕдиница)");
	КонецЕсли; 
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ?(ЗначениеЗаполнено(СтруктурнаяЕдиница), СтруктурнаяЕдиница, МассивСтруктурныхЕдиниц));
	
	Запрос.УстановитьПараметр("Контрагент", 		Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции 

&НаКлиенте
// Процедура - Обработка сделки взаимодействия клиента завершение.
//
Процедура ОбработчикВыбораСделкиВзаимодействия(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		УстановитьСостояниеЭлементовСделкиВзаимодействия(Результат.Значение.Сделка, Результат.Значение.ЦветЭтапа);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Создать документ РассылкаСообщений и отправить SMS.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументРассылкаСообщенийИОтправитьSMSНаСервере(Получатель, НомерТелефона, Содержание, Сделка, СтруктурнаяЕдиница, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Получатель, НомерТелефона", Получатель, НомерТелефона));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"        , МассивСтруктурПолучателей);
	ПараметрыРассылки.Вставить("Содержание"        , Содержание);
	ПараметрыРассылки.Вставить("Сделка"            , Сделка);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ПараметрыРассылки.Вставить("ОтправкаSMS"       , Истина);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ РассылкаСообщений и отправить Push.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументРассылкаСообщенийИОтправитьPushНаСервере(Получатель, СервисРассылки, Содержание, Сделка, СтруктурнаяЕдиница, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	
	СтруктураПолучателя = Новый Структура("Получатель", Получатель);
	МассивСтруктурПолучателей.Добавить(СтруктураПолучателя);
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"			, МассивСтруктурПолучателей);
	ПараметрыРассылки.Вставить("Содержание"			, Содержание);
	ПараметрыРассылки.Вставить("Сделка"				, Сделка); 
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	ПараметрыРассылки.Вставить("СервисРассылки"		, СервисРассылки);
	ПараметрыРассылки.Вставить("ОтправкаPush"		, Истина);
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  Тема						 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Тема, Содержание, Сделка, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Контакт, Адрес));
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"             , ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"             , Тема);
	ДанныеЗаполнения.Вставить("Тело"             , Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей", МассивСтруктурПолучателей);
	ДанныеЗаполнения.Вставить("Сделка"           , Сделка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	Возврат Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Создать документ РассылкаСообщений и отправить сообщение в мессенджер.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументРассылкаСообщенийИОтправитьСообщениеМессенджерНаСервере(Получатель, ДанныеКанала, Содержание, СтруктурнаяЕдиница, ШаблонСообщения, ДокументОснование, ОписаниеОшибки)
	
	МассивСтруктурПолучателей = Новый Массив;
	
	СтруктураПолучателя = Новый Структура;
	СтруктураПолучателя.Вставить("Получатель", Получатель);
	
	Если Не ЗначениеЗаполнено(ДанныеКанала.ИдКлиента) Тогда
		СтруктураПолучателя.Вставить("НомерТелефона", ДанныеКанала.НомерМессенджера);
	КонецЕсли;
	
	МассивСтруктурПолучателей.Добавить(СтруктураПолучателя);
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"				, МассивСтруктурПолучателей);
	ПараметрыРассылки.Вставить("Содержание"				, Содержание);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница"		, СтруктурнаяЕдиница);
	ПараметрыРассылки.Вставить("ОтправкаMessenger"		, Истина);
	ПараметрыРассылки.Вставить("ВнешняяСистема"			, ДанныеКанала.ВнешняяСистема);
	ПараметрыРассылки.Вставить("ИнициироватьОтправку"	, Истина);
	ПараметрыРассылки.Вставить("ОтправитьНемедленно"	, Истина);    
	ПараметрыРассылки.Вставить("ШаблонСообщения"		, ШаблонСообщения);
	ПараметрыРассылки.Вставить("ДокументОснование"		, ДокументОснование);
	
	Если ДанныеКанала.ВнешняяСистема.ТипВнешнейСистемы = Перечисления.ТипыВнешнихСистем.GreenApi Тогда
		
		ПараметрыОтправки = Новый Структура("НомерТелефона", ДанныеКанала.НомерМессенджера);
		ПараметрыРассылки.Вставить("ПараметрыОтправки", ПараметрыОтправки);
		
	КонецЕсли;
	
	Если РольДоступна("ИспользованиеМессенджера") Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Возврат Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецФункции

&НаСервере
// Процедура, заполняет список телефонов, которые связаны с  контактами мессенджерамов.
//
Процедура ЗаполнитьСписокТелефоновДляWhatsApp()
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
		|		ПО КонтрагентыКонтактнаяИнформация.Ссылка = КонтактыМессенджеров.ОбъектИдентификации
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона = КонтактыМессенджеров.НомерМессенджера");
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ЭтотОбъект.СписокТелефоновДляWhatsApp.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("НомерТелефона"));
	Иначе 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкиКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	Справочник.Заявки.КонтактнаяИнформация КАК ЗаявкиКонтактнаяИнформация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактыМессенджеров КАК КонтактыМессенджеров
		|		ПО ЗаявкиКонтактнаяИнформация.Ссылка = КонтактыМессенджеров.ОбъектИдентификации
		|ГДЕ
		|	ЗаявкиКонтактнаяИнформация.Ссылка = &Заявка
		|	И ЗаявкиКонтактнаяИнформация.НомерТелефона <> """"
		|	И ЗаявкиКонтактнаяИнформация.НомерТелефона = КонтактыМессенджеров.НомерМессенджера");
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		ЭтотОбъект.СписокТелефоновДляWhatsApp.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("НомерТелефона"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
